In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns 

%matplotlib inline

In [3]:
df = pd.read_excel('./data/default_of_credit_card_clients__courseware_version_1_21_19.xls')

In [4]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [5]:
df.shape

(30000, 25)

In [6]:
df.columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_1',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  int64
 2   SEX                         30000 non-null  int64
 3   EDUCATION                   30000 non-null  int64
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_1                       30000 non-null  object
 7   PAY_2                       30000 non-null  int64
 8   PAY_3                       30000 non-null  int64
 9   PAY_4                       30000 non-null  int64
 10  PAY_5                       30000 non-null  int64
 11  PAY_6                       30000 non-null  int64
 12  BILL_AMT1                   30000 non-null  int64
 13  BILL_AMT2                   30000 non-null  int64
 14  BILL_AMT3                   30000 non-null  int64
 15  BILL_AMT4                   30000 non-null  int64
 16  BILL_AMT5                   30000 non-null  int64
 17  BILL_AMT6                   30000 non-null  int64
 18  PAY_AMT1                    30000 non-null  int64
 19  PAY_AMT2                    30000 non-null  int64
 20  PAY_AMT3                    30000 non-null  int64
 21  PAY_AMT4                    30000 non-null  int64
 22  PAY_AMT5                    30000 non-null  int64
 23  PAY_AMT6                    30000 non-null  int64
 24  default payment next month  30000 non-null  int64
dtypes: int64(23), object(2)
memory usage: 5.7+ MB

## Data Cleaning

In [8]:
# total unique rows in the dataset
df['ID'].nunique()

29687

In [13]:
# total rows in the dataset
df['ID'].shape

(30000,)

In [15]:
# count of the duplicate and unique values
id_counts = df['ID'].value_counts()
id_counts.value_counts()

1    29374
2      313
Name: ID, dtype: int64

In [16]:
# storing the dup as a mask to filter the duplicate rows
dup = id_counts == 2
dup[:5]

062f1fe4-9a66    True
54ada30b-750f    True
249b09c0-f4c7    True
1c7af562-f271    True
31d0095f-75bc    True
Name: ID, dtype: bool

In [20]:
# the values of the mask can be indexed
id_counts.index[:5]

Index(['062f1fe4-9a66', '54ada30b-750f', '249b09c0-f4c7', '1c7af562-f271',
       '31d0095f-75bc'],
      dtype='object')

In [22]:
# filtering out the duplicate rows
dup_ids = id_counts.index[dup]
dup_ids = list(dup_ids)
len(dup_ids)

313

In [23]:
# duplicate rows
dup_ids

['062f1fe4-9a66',
 '54ada30b-750f',
 '249b09c0-f4c7',
 '1c7af562-f271',
 '31d0095f-75bc',
 '73ed1381-3a3f',
 '61ae560c-4479',
 'f5e3478e-cf68',
 '42009c72-651f',
 '3884eeca-7714',
 '6ff744d5-91f0',
 '8b62a9c9-7b64',
 '85bd7f39-2e9b',
 '62608fd2-d7fb',
 '0d624cb8-e5f8',
 'dd019fd7-f591',
 'ff619017-560f',
 '3393c9e4-3345',
 'd9dafe9c-b497',
 '7b6e060a-97a0',
 '9d3d2a55-dab6',
 '5f483bdb-3aaf',
 '84dc097a-dee3',
 'e4936e97-da48',
 '72598524-ef0b',
 '05009844-7be8',
 '91321f74-e4a4',
 'e8bcb1bb-456e',
 '0170086d-7472',
 'c5368117-b498',
 '1d58344c-5793',
 '9878723a-0b58',
 'f63d8fbe-d79e',
 '994330b6-eeec',
 '01355f46-3f0b',
 '2189fc56-f82a',
 '129c43ca-42ee',
 '56126c14-b5b8',
 '27e04c06-487f',
 '8d3a2576-a958',
 'dda76366-a407',
 'ae6a7eed-bb58',
 '7fe414ae-32f8',
 'effb69b1-d4d8',
 '428b26a3-dca2',
 '20b16b21-8b23',
 '64fe3b96-7ed0',
 'f31d1048-5fa9',
 '94d59251-fa7f',
 '0a2dceda-b597',
 'a3e05a29-d6df',
 '3fd4854f-8752',
 'a3a5c0fc-fdd6',
 'b4937915-ad67',
 'dab579ee-1645',
 'edd737fd-5b07',
 '20050b52-5d6e',
 '379e0b03-4ca0',
 'a53a8d32-2c61',
 '0a8272b2-78aa',
 '590a776e-5049',
 '0ab4e6e8-69e5',
 '742d1d93-0d3b',
 'ff6e1bd3-4e91',
 '733aa344-0dae',
 '999b7824-373c',
 '527c11ea-113e',
 'f9d25524-9d69',
 '266c34a2-16c9',
 '91084359-8bd4',
 'c84dd06b-71f5',
 '83d174e1-5f9a',
 '5795a795-bfa0',
 'c9826d63-f7d3',
 '168dcd08-0ed9',
 'e7cd8c1a-88e9',
 'd6697da8-74fc',
 'a51dbaae-d88b',
 '693a0664-bde6',
 'bf23c70b-bf12',
 '98395d08-9643',
 '5deff6b6-62ff',
 '382b378c-6383',
 'd2a47fa6-0f6a',
 '3367c92b-b1ca',
 '3d832783-1571',
 'a7e199e1-2c44',
 'fa286931-8ded',
 '5f38afd8-e138',
 'f56a0841-4328',
 'e3035b40-0c02',
 '659da309-053c',
 'e850d228-6879',
 'ff8b7170-ce3a',
 'a7559852-f405',
 '2a793ecf-05c6',
 'd13465a5-a9e0',
 '415c344e-309f',
 '7b7cc3cd-0b76',
 '4f249cbc-5e9c',
 'bbf202ae-a964',
 'cd944abe-cef9',
 'd5aeb496-64e5',
 'f9bcd13e-96bc',
 '73baf2c4-6e90',
 'f20d8a3d-d047',
 '63b20368-1a04',
 'c3ae3600-3837',
 'f0bb9e5a-eb11',
 '16d73782-d5e6',
 'df3d13be-9c13',
 'b74033dc-6e45',
 'c3ddce11-35e2',
 '7be61027-a493',
 '5f79f818-18af',
 '15edb406-305b',
 '4cb27699-fe3f',
 'f41bbcf7-5f86',
 '80282ca6-96a6',
 'af9f7f07-e228',
 '5ce60722-dbd1',
 '3e60a98c-e520',
 '5edb4d2b-067c',
 '4534975d-bf92',
 '1a055566-c187',
 'f37328b4-7b3a',
 '90f662f9-c1e3',
 'c69162db-4864',
 '51e5ff58-5a0f',
 '7dbc4ebf-4b4f',
 '6d1fc219-67b0',
 'e07a0034-42af',
 '8f4a90bc-bbb0',
 '4f95b36b-ab10',
 '98b8a2ca-8988',
 '9ac5d94f-ed71',
 '62b1d551-2414',
 '9e74795e-cb34',
 '04299d54-61d4',
 '08425e64-bf76',
 '297edb0f-3bb1',
 '1b22b0ab-aba3',
 '165206d2-50a5',
 'd5905747-8aef',
 'a9870d3e-b4d1',
 'f11c5e51-a535',
 '59387843-6db1',
 'ffa0f012-3bd7',
 '214fc1ca-b25a',
 'fc73f07e-eb96',
 'db91a87c-3cbe',
 'af1e3f79-f628',
 '68ff6fcd-1d49',
 '9c53fb07-9b73',
 '93b2c5f7-acea',
 '823267c1-561b',
 '3cd5c728-df14',
 'e668604e-21f6',
 'f0b963e7-4933',
 '555a25cd-2d05',
 '2ba2d987-103e',
 'cfa9d026-de0d',
 '4dc45e9a-27bd',
 '369e565a-26a1',
 'b46f955f-9e8a',
 'feac3745-a2be',
 '75bdf204-83c2',
 '96970f37-abaa',
 'accba688-8ec1',
 'a17f0f1f-d9f6',
 '8a6bbf3d-8a2d',
 '7c9b7473-cc2f',
 '37499e8b-ac16',
 '060c8137-6a4e',
 'e8ee55be-0a11',
 '9a75e346-c849',
 '87dec940-75b7',
 '956cbf4a-d24e',
 '841ae407-dc4c',
 '33b2b726-61a8',
 '355fe35a-5db7',
 'f7fe4368-18e7',
 '7d5f3242-e1df',
 '69566a6b-6156',
 '30729bb5-55d7',
 'bdb3b33c-83a9',
 'b9591d1a-8480',
 'e50d8395-da32',
 '8d1b6de3-9795',
 '52bcd5ae-72d3',
 '89d3cebd-346f',
 '6353fd55-d66e',
 'ab09b4b4-8331',
 'ad63957b-ea9a',
 '3fddeb07-b7f0',
 '5718f600-12ac',
 '26d4a6eb-8abe',
 'dbf9fb14-2656',
 'f6032812-464e',
 'f12b9d9e-ada0',
 '94d8b70f-361d',
 '4e2380e6-a8cf',
 'a9ce8636-9a88',
 'b3c9d09b-ed59',
 '5b8dce34-2ded',
 'b44b81b2-7789',
 '0724677e-ec01',
 '0d66d575-c461',
 '56945919-0933',
 '75938fec-e5ec',
 '1fb3e3e6-a68d',
 '77222291-e191',
 'e39d23fe-aa5f',
 '04c32736-903c',
 'b1c90397-5fb2',
 'fd6033f4-cc72',
 '26bde6da-f148',
 '7e7a4087-4def',
 'ea8d41fd-b8a3',
 'ad819541-5d3c',
 'b87bf8f3-d704',
 '2a8ad33f-fa9c',
 '71b5009c-75c8',
 '7574bf9e-f3f9',
 '9db1809e-845a',
 'b6ca3733-7459',
 '86477d4e-795e',
 '8567249b-827e',
 '6870544f-459e',
 '28866128-6286',
 '2458b96d-e8f1',
 'ad23fe5c-7b09',
 '6c0797cd-f663',
 '5f463f95-a4ae',
 'f0723a52-7018',
 '3d61e71b-f65e',
 '1512a948-a7e4',
 '315e4f9d-2b0b',
 'e8037410-5cd0',
 '40e75290-0f59',
 '2a8713e6-0f03',
 '82da3aa5-97a6',
 '443324fb-5cfc',
 'd1808f44-48ce',
 '9929aa3b-d8f6',
 'c89b26ff-ec7f',
 '9611f432-7f70',
 '424e8a3c-0377',
 '310d5326-56c7',
 'ef889a72-06f5',
 '4ae0efd7-2651',
 '3cfed539-ad58',
 '4653bc48-0141',
 'e7f574b9-0581',
 'ebda7f71-7024',
 '2f4f4bc9-fd55',
 'bbffebbc-e3c4',
 '998fa9b2-b341',
 '25a28c93-508a',
 'c8bb762f-3ef9',
 'ca3910f2-92ca',
 'ac821a7b-b399',
 'ffb9a143-c375',
 '3511ed92-c434',
 'ddcc7278-7017',
 '94c4ece8-bba6',
 'bae9475e-7cad',
 '4fcef74d-0b3d',
 '89f8f447-fca8',
 '45cceda0-6fb7',
 '2618fdc4-e731',
 'cb18af1f-3b53',
 '634d5510-7240',
 '47d9ee33-0df0',
 'c361e43d-f1f4',
 '4a051fdc-d04c',
 'db903e22-a55a',
 '9e6e766d-ba75',
 '0ad143f2-bd95',
 '0a37c2c7-6065',
 '4cf8397f-6359',
 '90330d02-82d9',
 '91c69d1a-8732',
 '02e41927-a6df',
 '73ea498f-44b2',
 '0913d642-c5d4',
 '0a2d6db4-0c54',
 'a9d910f4-fe9a',
 '0a5048ae-e120',
 '327d06d5-ce7f',
 'af052d9b-f06b',
 '63338f74-01be',
 '94e1b326-8c22',
 '183f18d5-0b44',
 'cdae2be5-8ec4',
 'adeed333-dbfd',
 'b557f3c2-ebec',
 'e77f7765-8731',
 '775d61d0-4715',
 '71b26a8d-da70',
 '1bf3b4eb-d759',
 '3327c2a8-3402',
 'f86688f1-8742',
 '8f9549b7-d5a4',
 '9389d6e1-e1a7',
 'd50ebd87-8b6d',
 '97f74dea-338e',
 '06f377a6-ba7e',
 '97d1d2eb-c72f',
 '16ee3668-0b5b',
 '37a1d9c2-701c',
 'c5a658d0-92da',
 '33bf169b-258a']

In [24]:
df.loc[df['ID'].isin(dup_ids),:].head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
141,26bde6da-f148,180000,1,2,2,28,-1,-1,-1,-1,...,332,416,416,0,416,332,500,3500,832,0
196,42009c72-651f,150000,2,2,1,34,-2,-2,-2,-2,...,116,0,1500,0,0,116,0,1500,0,0
241,26bde6da-f148,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
296,42009c72-651f,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
323,73ed1381-3a3f,230000,2,2,1,28,0,0,0,-2,...,2100,767,6173,1710,1100,1000,767,6173,1000,1

In [26]:
df.loc[296]

ID                            42009c72-651f
LIMIT_BAL                                 0
SEX                                       0
EDUCATION                                 0
MARRIAGE                                  0
AGE                                       0
PAY_1                                     0
PAY_2                                     0
PAY_3                                     0
PAY_4                                     0
PAY_5                                     0
PAY_6                                     0
BILL_AMT1                                 0
BILL_AMT2                                 0
BILL_AMT3                                 0
BILL_AMT4                                 0
BILL_AMT5                                 0
BILL_AMT6                                 0
PAY_AMT1                                  0
PAY_AMT2                                  0
PAY_AMT3                                  0
PAY_AMT4                                  0
PAY_AMT5                                  0
PAY_AMT6                                  0
default payment next month                0
Name: 296, dtype: object

### Looks like some rows have only zero values which is useless,
### we will remove those rows

In [27]:
zero_mask = df == 0
zero_mask

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,False,False,False,False,False,False,False,False,False,False,...,True,True,True,True,False,True,True,True,True,False
1,False,False,False,False,False,False,False,False,True,True,...,False,False,False,True,False,False,False,True,False,False
2,False,False,False,False,False,False,True,True,True,True,...,False,False,False,False,False,False,False,False,False,True
3,False,False,False,False,False,False,True,True,True,True,...,False,False,False,False,False,False,False,False,False,True
4,False,False,False,False,False,False,False,True,False,True,...,False,False,False,False,False,False,False,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,False,False,False,False,False,False,True,True,True,True,...,False,False,False,False,False,False,False,False,False,True
29996,False,False,False,False,False,False,False,False,False,False,...,False,False,True,False,False,False,False,True,True,True
29997,False,False,False,False,False,False,False,False,False,False,...,False,False,False,True,True,False,False,False,False,False
29998,False,False,False,False,False,False,False,False,True,True,...,False,False,False,False,False,False,False,False,False,False
29999,False,False,False,False,False,False,True,True,True,True,...,False,False,False,False,False,False,False,False,False,False

In [29]:
all_zeros = zero_mask.iloc[:,1:].all(axis=1)

In [30]:
sum(all_zeros)

315

In [31]:
df_cleaned = df.loc[~all_zeros,:].copy()
df_cleaned.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [33]:
df_cleaned['ID'].nunique()

29685

In [34]:
df_cleaned.shape

(29685, 25)

In [35]:
# checking the columns of the data
df_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 29685 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          29685 non-null  object
 1   LIMIT_BAL                   29685 non-null  int64
 2   SEX                         29685 non-null  int64
 3   EDUCATION                   29685 non-null  int64
 4   MARRIAGE                    29685 non-null  int64
 5   AGE                         29685 non-null  int64
 6   PAY_1                       29685 non-null  object
 7   PAY_2                       29685 non-null  int64
 8   PAY_3                       29685 non-null  int64
 9   PAY_4                       29685 non-null  int64
 10  PAY_5                       29685 non-null  int64
 11  PAY_6                       29685 non-null  int64
 12  BILL_AMT1                   29685 non-null  int64
 13  BILL_AMT2                   29685 non-null  int64
 14  BILL_AMT3                   29685 non-null  int64
 15  BILL_AMT4                   29685 non-null  int64
 16  BILL_AMT5                   29685 non-null  int64
 17  BILL_AMT6                   29685 non-null  int64
 18  PAY_AMT1                    29685 non-null  int64
 19  PAY_AMT2                    29685 non-null  int64
 20  PAY_AMT3                    29685 non-null  int64
 21  PAY_AMT4                    29685 non-null  int64
 22  PAY_AMT5                    29685 non-null  int64
 23  PAY_AMT6                    29685 non-null  int64
 24  default payment next month  29685 non-null  int64
dtypes: int64(23), object(2)
memory usage: 7.1+ MB

In [38]:
df_cleaned['PAY_1'].value_counts()

0                13087
-1                5047
1                 3261
Not available     3021
-2                2476
2                 2378
3                  292
4                   63
5                   23
8                   17
6                   11
7                    9
Name: PAY_1, dtype: int64

In [40]:
# removing the rows which have values not available
df_cleaned = df_cleaned.loc[df_cleaned['PAY_1'] != 'Not available']

In [41]:
df_cleaned.shape

(26664, 25)

In [42]:
df_cleaned['PAY_1'].value_counts()

 0    13087
-1     5047
 1     3261
-2     2476
 2     2378
 3      292
 4       63
 5       23
 8       17
 6       11
 7        9
Name: PAY_1, dtype: int64

In [43]:
# convert the column to integer
df_cleaned['PAY_1'] = df_cleaned['PAY_1'].astype('int64')

In [44]:
df_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26664 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          26664 non-null  object
 1   LIMIT_BAL                   26664 non-null  int64
 2   SEX                         26664 non-null  int64
 3   EDUCATION                   26664 non-null  int64
 4   MARRIAGE                    26664 non-null  int64
 5   AGE                         26664 non-null  int64
 6   PAY_1                       26664 non-null  int64
 7   PAY_2                       26664 non-null  int64
 8   PAY_3                       26664 non-null  int64
 9   PAY_4                       26664 non-null  int64
 10  PAY_5                       26664 non-null  int64
 11  PAY_6                       26664 non-null  int64
 12  BILL_AMT1                   26664 non-null  int64
 13  BILL_AMT2                   26664 non-null  int64
 14  BILL_AMT3                   26664 non-null  int64
 15  BILL_AMT4                   26664 non-null  int64
 16  BILL_AMT5                   26664 non-null  int64
 17  BILL_AMT6                   26664 non-null  int64
 18  PAY_AMT1                    26664 non-null  int64
 19  PAY_AMT2                    26664 non-null  int64
 20  PAY_AMT3                    26664 non-null  int64
 21  PAY_AMT4                    26664 non-null  int64
 22  PAY_AMT5                    26664 non-null  int64
 23  PAY_AMT6                    26664 non-null  int64
 24  default payment next month  26664 non-null  int64
dtypes: int64(24), object(1)
memory usage: 6.5+ MB